app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["text", "world"], ["created_at", 2016-12-04 00:31:41 UTC], ["updated_at", 2016-12-04 00:31:41 UTC]]
---
  def create
    @article = Article.new(article_params)

    @article.save